IDEA StatiCa Open Model
LineSegment2D Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The LineSegment2D type exposes the following members.
Properties
Name | Description
EndPoint
 Gets or sets the endpoint of the segment.
 (Inherited from Segment2D.)
Top
See Also
Reference
LineSegment2D Class
IdeaRS.OpenModel.Geometry2D Namespace